{
	"FormatVersion": 2,
	"Namespace": "",
	"Children": [
		{
			"Source":
			{
				"Text": "!!!"
			},
			"Translation":
			{
				"Text": "!!!"
			},
			"Key": "3DABE3A74DD917ACEFED16960CF25D4B"
		},
		{
			"Source":
			{
				"Text": "!!!"
			},
			"Translation":
			{
				"Text": "!!!"
			},
			"Key": "54D119B5452BDBED2EB79293D5253325"
		},
		{
			"Source":
			{
				"Text": "!!!"
			},
			"Translation":
			{
				"Text": "!!!"
			},
			"Key": "7E71EAA7482A09DC4D6681A93DC0FCED"
		},
		{
			"Source":
			{
				"Text": "!!!"
			},
			"Translation":
			{
				"Text": "!!!"
			},
			"Key": "079483B9415C56495BC795A51537F96B"
		},
		{
			"Source":
			{
				"Text": "# of rows to show in the editor.\r\nThe game will add a scrollbar if the tree gets too long for one screen."
			},
			"Translation":
			{
				"Text": "# of rows to show in the editor.\r\nThe game will add a scrollbar if the tree gets too long for one screen."
			},
			"Key": "2F2C05A5455271FE743B378AAEF200D1"
		},
		{
			"Source":
			{
				"Text": "(Discards Unsaved Changes!)"
			},
			"Translation":
			{
				"Text": "(Discards Unsaved Changes!)"
			},
			"Key": "6904CBF342C35F9331ECAF9D1F619694"
		},
		{
			"Source":
			{
				"Text": "(No Schematic)"
			},
			"Translation":
			{
				"Text": "(No Schematic)"
			},
			"Key": "06598E6A46ACE7864C56F491654DB81D"
		},
		{
			"Source":
			{
				"Text": "(No schematic assigned - node disabled)"
			},
			"Translation":
			{
				"Text": "(No schematic assigned - node disabled)"
			},
			"Key": "896CD6E345ADDBBF0173779105F74DA3"
		},
		{
			"Source":
			{
				"Text": "(No schematic at this position)"
			},
			"Translation":
			{
				"Text": "(No schematic at this position)"
			},
			"Key": "C14BBA7C403D86B4EE797FB359E2BAC7"
		},
		{
			"Source":
			{
				"Text": "(Node Display Name)"
			},
			"Translation":
			{
				"Text": "(Node Display Name)"
			},
			"Key": "BCFEDDC24EA6092268B655B0A0AA4210"
		},
		{
			"Source":
			{
				"Text": "(Unsaved Changes!)"
			},
			"Translation":
			{
				"Text": "(Unsaved Changes!)"
			},
			"Key": "ED1DE74C4B7B38CA779971B3584096F3"
		},
		{
			"Source":
			{
				"Text": "- Hover over UI elements to learn more\r\n- Right mouse button or scroll wheel to pan\r\n- Save early, save often\r\n- Click and hold left mouse to drag nodes between positions (may need to redo parent+unhidden after moving)\r\n- Trees should flow from top to bottom\r\n- Roads displayed in this tool are approximations of the ones the game will draw\r\n- Research trees ignore most unlock restrictions specified in the node's schematic, only the ones specified by the node logic apply\r\n- Schematic descriptions aren't visible to the player unless MAM Enhancer is installed"
			},
			"Translation":
			{
				"Text": "- Hover over UI elements to learn more\r\n- Right mouse button or scroll wheel to pan\r\n- Save early, save often\r\n- Click and hold left mouse to drag nodes between positions (may need to redo parent+unhidden after moving)\r\n- Trees should flow from top to bottom\r\n- Roads displayed in this tool are approximations of the ones the game will draw\r\n- Research trees ignore most unlock restrictions specified in the node's schematic, only the ones specified by the node logic apply\r\n- Schematic descriptions aren't visible to the player unless MAM Enhancer is installed"
			},
			"Key": "8EC871F54351890A8E8143BA1F7F5E37"
		},
		{
			"Source":
			{
				"Text": "0"
			},
			"Translation":
			{
				"Text": "0"
			},
			"Key": "679613DB44999D3399D4E080E1A4C486"
		},
		{
			"Source":
			{
				"Text": "Add a new hidden node entry"
			},
			"Translation":
			{
				"Text": "Add a new hidden node entry"
			},
			"Key": "E387C31D45CA0D8835B20DB3F19FF220"
		},
		{
			"Source":
			{
				"Text": "Advanced feature.\r\n\r\n\"Hidden Nodes\" don't appear to the player in the tree,\r\nbut they can still influence node dependency logic.\r\nYou can use this to make nodes depend on schematics\r\nthat aren't otherwise part of the tree to be unlocked. \r\n\r\nWhen a Hidden Node is a parent of another node,\r\na road will not be drawn between it and that node.\r\n\r\nBe careful with these because their use\r\ncan make a tree confusing to the player."
			},
			"Translation":
			{
				"Text": "Advanced feature.\r\n\r\n\"Hidden Nodes\" don't appear to the player in the tree,\r\nbut they can still influence node dependency logic.\r\nYou can use this to make nodes depend on schematics\r\nthat aren't otherwise part of the tree to be unlocked. \r\n\r\nWhen a Hidden Node is a parent of another node,\r\na road will not be drawn between it and that node.\r\n\r\nBe careful with these because their use\r\ncan make a tree confusing to the player."
			},
			"Key": "16D16F814F549DE90F3A5AAB6B11CBBB"
		},
		{
			"Source":
			{
				"Text": "Background Grid Animation:"
			},
			"Translation":
			{
				"Text": "Background Grid Animation:"
			},
			"Key": "EF8CFE4648727DB050678FB6D1184899"
		},
		{
			"Source":
			{
				"Text": "Child"
			},
			"Translation":
			{
				"Text": "Child"
			},
			"Key": "561F3A4D481AD339CE2EA2A6237E6D98"
		},
		{
			"Source":
			{
				"Text": "Children"
			},
			"Translation":
			{
				"Text": "Children"
			},
			"Key": "1D53B29249B272EF52A830A98739597B"
		},
		{
			"Source":
			{
				"Text": "Class name of the schematic at the node you have selected"
			},
			"Translation":
			{
				"Text": "Class name of the schematic at the node you have selected"
			},
			"Key": "F08707C24106D5F3E45D57B5409A8F1D"
		},
		{
			"Source":
			{
				"Text": "Clear Schematic"
			},
			"Translation":
			{
				"Text": "Clear Schematic"
			},
			"Key": "3EC14605468BEA755BFDDF84871E320C"
		},
		{
			"Source":
			{
				"Text": "Clear Schematic"
			},
			"Translation":
			{
				"Text": "Clear Schematic"
			},
			"Key": "733903A44FB8341052E76A94C110AD82"
		},
		{
			"Source":
			{
				"Text": "Clear the schematic associated with the selected node.\r\nIn the game, there won't be a node here.\r\n\r\nThe schematic asset will still exist in the mod.\r\nTree connections are preserved - that data is stored per node, not per schematic."
			},
			"Translation":
			{
				"Text": "Clear the schematic associated with the selected node.\r\nIn the game, there won't be a node here.\r\n\r\nThe schematic asset will still exist in the mod.\r\nTree connections are preserved - that data is stored per node, not per schematic."
			},
			"Key": "BF106E684E7262D16A983C9F8487AA8D"
		},
		{
			"Source":
			{
				"Text": "Clear the schematic associated with the selected node.\r\nIn the game, there won't be a node here.\r\n\r\nThe schematic asset will still exist in the mod.\r\nTree connections are preserved - that data is stored per node, not per schematic."
			},
			"Translation":
			{
				"Text": "Clear the schematic associated with the selected node.\r\nIn the game, there won't be a node here.\r\n\r\nThe schematic asset will still exist in the mod.\r\nTree connections are preserved - that data is stored per node, not per schematic."
			},
			"Key": "95AA9A42462D6505611C1B9E5213EB9D"
		},
		{
			"Source":
			{
				"Text": "Clears all coordinate entries"
			},
			"Translation":
			{
				"Text": "Clears all coordinate entries"
			},
			"Key": "640272C546BAC1AF584EE88232A331B3"
		},
		{
			"Source":
			{
				"Text": "Color Legend: Nodes that get Unhidden\r\n\r\nWhen a node is selected, nodes that will be Unhidden By it (and roads to them) will have this color.\r\nSee the help tooltip for \"To Unhide\" for more info."
			},
			"Translation":
			{
				"Text": "Color Legend: Nodes that get Unhidden\r\n\r\nWhen a node is selected, nodes that will be Unhidden By it (and roads to them) will have this color.\r\nSee the help tooltip for \"To Unhide\" for more info."
			},
			"Key": "82A93C764B68721F7824FBAF09DF6F20"
		},
		{
			"Source":
			{
				"Text": "Color Legend: Parent Nodes\r\n\r\nWhen a node is selected, nodes that it defines as Parents (and roads to them) will have this color."
			},
			"Translation":
			{
				"Text": "Color Legend: Parent Nodes\r\n\r\nWhen a node is selected, nodes that it defines as Parents (and roads to them) will have this color."
			},
			"Key": "C0F51D164B522120CFE8BB9D0A1600D8"
		},
		{
			"Source":
			{
				"Text": "Color Legend: Selected Node\r\n\r\nWhen a node is selected, it will have this color."
			},
			"Translation":
			{
				"Text": "Color Legend: Selected Node\r\n\r\nWhen a node is selected, it will have this color."
			},
			"Key": "28A934354B760BB4C8CB9D825FBD9A36"
		},
		{
			"Source":
			{
				"Text": "Configure via the right side panel"
			},
			"Translation":
			{
				"Text": "Configure via the right side panel"
			},
			"Key": "8D82F7C344AF8AA074F598A9CE2CB7D7"
		},
		{
			"Source":
			{
				"Text": "Connects to Hidden Node with no currently configured schematic!"
			},
			"Translation":
			{
				"Text": "Connects to Hidden Node with no currently configured schematic!"
			},
			"Key": "EB80C0F3487355501B411682FAFBF11B"
		},
		{
			"Source":
			{
				"Text": "Connects to Hidden Node with schematic: \"{SchematicName}\""
			},
			"Translation":
			{
				"Text": "Connects to Hidden Node with schematic: \"{SchematicName}\""
			},
			"Key": "17AD683746FDB94D6A88DABDFA790555"
		},
		{
			"Source":
			{
				"Text": "Connects with schematic: \"{SchematicName}\""
			},
			"Translation":
			{
				"Text": "Connects with schematic: \"{SchematicName}\""
			},
			"Key": "199B99CD48F0E708200E0391100B5B85"
		},
		{
			"Source":
			{
				"Text": "Contols which nodes to reveal the details of once this node is purchased by the player.\r\nIn the game, hovering a hidden node in the tree will display\r\n\"Node Unavailable\" and flash a key icon next to all nodes that can unhide it.\r\n\r\n**Nodes determine what other nodes they will reveal, not vice versa**\r\n\r\nIf a node is mentioned in any node's To Unhide list,\r\nits details will be obscured to the player\r\nuntil any one of the node's Unhiders is purchased.\r\n\r\nIf a node is not mentioned in any node's To Unhide list,\r\nits details will always be visible to the player.\r\n\r\nProperty of the currently selected node."
			},
			"Translation":
			{
				"Text": "Contols which nodes to reveal the details of once this node is purchased by the player.\r\nIn the game, hovering a hidden node in the tree will display\r\n\"Node Unavailable\" and flash a key icon next to all nodes that can unhide it.\r\n\r\n**Nodes determine what other nodes they will reveal, not vice versa**\r\n\r\nIf a node is mentioned in any node's To Unhide list,\r\nits details will be obscured to the player\r\nuntil any one of the node's Unhiders is purchased.\r\n\r\nIf a node is not mentioned in any node's To Unhide list,\r\nits details will always be visible to the player.\r\n\r\nProperty of the currently selected node."
			},
			"Key": "8B943C7444073DDC4C4175B1235E4B5F"
		},
		{
			"Source":
			{
				"Text": "Controls which node(s) can be purchased to unlock this node.\r\nAlso controls how roads are drawn between nodes.\r\n\r\n**Nodes decide who their parents are, not vice versa**\r\n\r\nIf multiple nodes are specified,\r\nonly one of them needs to be purchased\r\nfor this node to be unlocked.\r\n\r\nProperty of the currently selected node."
			},
			"Translation":
			{
				"Text": "Controls which node(s) can be purchased to unlock this node.\r\nAlso controls how roads are drawn between nodes.\r\n\r\n**Nodes decide who their parents are, not vice versa**\r\n\r\nIf multiple nodes are specified,\r\nonly one of them needs to be purchased\r\nfor this node to be unlocked.\r\n\r\nProperty of the currently selected node."
			},
			"Key": "FA765E144EF2E3858FA8B492A355D26A"
		},
		{
			"Source":
			{
				"Text": "Default"
			},
			"Translation":
			{
				"Text": "Default"
			},
			"Key": "67719E36496B3BA4A8E6F6805357838E"
		},
		{
			"Source":
			{
				"Text": "Delete this hidden node"
			},
			"Translation":
			{
				"Text": "Delete this hidden node"
			},
			"Key": "B3F96A594187A3ED22FD78A67706A5EF"
		},
		{
			"Source":
			{
				"Text": "Display name of the schematic at the node you have selected"
			},
			"Translation":
			{
				"Text": "Display name of the schematic at the node you have selected"
			},
			"Key": "F2FD538D40EC8BA3E07B36B78A9210AC"
		},
		{
			"Source":
			{
				"Text": "Double Click on a node to select it, drag-and-drop to move nodes"
			},
			"Translation":
			{
				"Text": "Double Click on a node to select it, drag-and-drop to move nodes"
			},
			"Key": "C437D3024B146047E917849FBBA307F3"
		},
		{
			"Source":
			{
				"Text": "Double Click to select"
			},
			"Translation":
			{
				"Text": "Double Click to select"
			},
			"Key": "FE051BD6465FA12D9BCFE68E61017381"
		},
		{
			"Source":
			{
				"Text": "Error: No asset selected"
			},
			"Translation":
			{
				"Text": "Error: No asset selected"
			},
			"Key": "D06FA70541B7158A5FCD82A649AA369F"
		},
		{
			"Source":
			{
				"Text": "Error: Selected asset not a mod config"
			},
			"Translation":
			{
				"Text": "Error: Selected asset not a mod config"
			},
			"Key": "DA12F6A94B5AD7C1552366A2CD166AD3"
		},
		{
			"Source":
			{
				"Text": "Example Button"
			},
			"Translation":
			{
				"Text": "Example Button"
			},
			"Key": "F5FC731B4980A066E0DB048B83BC5ACD"
		},
		{
			"Source":
			{
				"Text": "Failed to write to tree, invalid class "
			},
			"Translation":
			{
				"Text": "Failed to write to tree, invalid class "
			},
			"Key": "D372B81C48E083290243D68B0751DAAC"
		},
		{
			"Source":
			{
				"Text": "Hidden Nodes"
			},
			"Translation":
			{
				"Text": "Hidden Nodes"
			},
			"Key": "452C9A554E102E0E82A413BAB06C5087"
		},
		{
			"Source":
			{
				"Text": "Hidden Nodes must have negative Y positions.\r\nY = -1 is still slightly on screen,\r\nY <= -2 is entirely off screen"
			},
			"Translation":
			{
				"Text": "Hidden Nodes must have negative Y positions.\r\nY = -1 is still slightly on screen,\r\nY <= -2 is entirely off screen"
			},
			"Key": "9AB8114F4648378DB53229A579DC20D4"
		},
		{
			"Source":
			{
				"Text": "InvalidSelectedSchematic"
			},
			"Translation":
			{
				"Text": "InvalidSelectedSchematic"
			},
			"Key": "DFA9E3384C4DB4A1EBD11BB4F0137C8F"
		},
		{
			"Source":
			{
				"Text": "InvalidSelectedSchematicType"
			},
			"Translation":
			{
				"Text": "InvalidSelectedSchematicType"
			},
			"Key": "6CA03AB744569305F26DDFAB5850530D"
		},
		{
			"Source":
			{
				"Text": "InvalidSelectedTree"
			},
			"Translation":
			{
				"Text": "InvalidSelectedTree"
			},
			"Key": "09243ED14CA2AF79C6983ABDDBD42A47"
		},
		{
			"Source":
			{
				"Text": "Load Selected Tree"
			},
			"Translation":
			{
				"Text": "Load Selected Tree"
			},
			"Key": "F051282B4B6157BB385E73AEC3C087B9"
		},
		{
			"Source":
			{
				"Text": "LoadSuccess"
			},
			"Translation":
			{
				"Text": "LoadSuccess"
			},
			"Key": "A44C40ED4585209B9F893B9F55A72D7D"
		},
		{
			"Source":
			{
				"Text": "Loaded {treename}"
			},
			"Translation":
			{
				"Text": "Loaded {treename}"
			},
			"Key": "E3D7E4AC418178A3746DD3993D565674"
		},
		{
			"Source":
			{
				"Text": "Loads the asset you have selected in a Content Browser into this editor.\r\nMake sure it is a descendent of FGResearchTree.\r\nDiscards any unsaved changes!\r\n\r\nIf doing this crashes the editor, try opening the tree asset first, then using this button."
			},
			"Translation":
			{
				"Text": "Loads the asset you have selected in a Content Browser into this editor.\r\nMake sure it is a descendent of FGResearchTree.\r\nDiscards any unsaved changes!\r\n\r\nIf doing this crashes the editor, try opening the tree asset first, then using this button."
			},
			"Key": "35306E9B4F7F4903CC3ED890ABC3FE89"
		},
		{
			"Source":
			{
				"Text": "Manually add a new coordinate entry"
			},
			"Translation":
			{
				"Text": "Manually add a new coordinate entry"
			},
			"Key": "5041A74B4721436A59673F86ADFECF9D"
		},
		{
			"Source":
			{
				"Text": "My Parents"
			},
			"Translation":
			{
				"Text": "My Parents"
			},
			"Key": "A6FAE72847EAF7E9CD77D790EFE85117"
		},
		{
			"Source":
			{
				"Text": "No errors were detected\r\n{Messages}"
			},
			"Translation":
			{
				"Text": "No errors were detected\r\n{Messages}"
			},
			"Key": "87DDEB534997CA6F932B42A7F2F1F007"
		},
		{
			"Source":
			{
				"Text": "NoClassSelected"
			},
			"Translation":
			{
				"Text": "NoClassSelected"
			},
			"Key": "556D993C4BB6C3F3AEC81587F9D25231"
		},
		{
			"Source":
			{
				"Text": "None"
			},
			"Translation":
			{
				"Text": "None"
			},
			"Key": "0D746A234C7362BAF901EC9FB1378DF1"
		},
		{
			"Source":
			{
				"Text": "Nothing was selected in a content browser"
			},
			"Translation":
			{
				"Text": "Nothing was selected in a content browser"
			},
			"Key": "43B7D44649D7B52594728EB057E55F29"
		},
		{
			"Source":
			{
				"Text": "OK"
			},
			"Translation":
			{
				"Text": "OK"
			},
			"Key": "8D1641384CB62A048BAE14BB868A3F4E"
		},
		{
			"Source":
			{
				"Text": "OK"
			},
			"Translation":
			{
				"Text": "OK"
			},
			"Key": "A1FF0331440CE28C1803E4BF18433F05"
		},
		{
			"Source":
			{
				"Text": "OK"
			},
			"Translation":
			{
				"Text": "OK"
			},
			"Key": "86BB1E2A4F93E909268E32A97C6ADEA8"
		},
		{
			"Source":
			{
				"Text": "One or more errors were found:\r\n{Messages}"
			},
			"Translation":
			{
				"Text": "One or more errors were found:\r\n{Messages}"
			},
			"Key": "248832C44794700F80D159A258444095"
		},
		{
			"Source":
			{
				"Text": "Parent"
			},
			"Translation":
			{
				"Text": "Parent"
			},
			"Key": "D9ACC6C44E8A63920DD046AB61CAB999"
		},
		{
			"Source":
			{
				"Text": "Parents"
			},
			"Translation":
			{
				"Text": "Parents"
			},
			"Key": "7200ED124A8B0D1BBE8ED4BBC24DD370"
		},
		{
			"Source":
			{
				"Text": "Remove"
			},
			"Translation":
			{
				"Text": "Remove"
			},
			"Key": "564F0A184FDBD4C760645896ED1419D9"
		},
		{
			"Source":
			{
				"Text": "Right-click on this asset in the Content Browser\r\nand select 'Run Editor Utility Widget'.\r\n\r\nAlternatively, perform the same steps on the\r\n'AssetAction_ResearchTreeHelper' asset,\r\nwhich will allow you to right-click on any\r\nFGResearchTree asset and select 'Open Tree Editor'\r\nfrom the 'Scripted Actions' section."
			},
			"Translation":
			{
				"Text": "Right-click on this asset in the Content Browser\r\nand select 'Run Editor Utility Widget'.\r\n\r\nAlternatively, perform the same steps on the\r\n'AssetAction_ResearchTreeHelper' asset,\r\nwhich will allow you to right-click on any\r\nFGResearchTree asset and select 'Open Tree Editor'\r\nfrom the 'Scripted Actions' section."
			},
			"Key": "274113A0432226623EA5E9AF53C231FE"
		},
		{
			"Source":
			{
				"Text": "RoadDefault"
			},
			"Translation":
			{
				"Text": "RoadDefault"
			},
			"Key": "2CDB5E3541ACDAB3B661A7A491864AD7"
		},
		{
			"Source":
			{
				"Text": "RoadParent"
			},
			"Translation":
			{
				"Text": "RoadParent"
			},
			"Key": "76E5043C401D93C464A5559F30746A2E"
		},
		{
			"Source":
			{
				"Text": "SAVE!"
			},
			"Translation":
			{
				"Text": "SAVE!"
			},
			"Key": "DA851C664B201E8733D1C2B240BACC4B"
		},
		{
			"Source":
			{
				"Text": "SaveFailure"
			},
			"Translation":
			{
				"Text": "SaveFailure"
			},
			"Key": "EC5B3F18427BA8DA65485CB096ACE023"
		},
		{
			"Source":
			{
				"Text": "SaveSuccess"
			},
			"Translation":
			{
				"Text": "SaveSuccess"
			},
			"Key": "A2D60E574D2757149C525383B19D57B1"
		},
		{
			"Source":
			{
				"Text": "Select a mod config asset in a Content Browser in the editor and then press this button to preview it in the widget."
			},
			"Translation":
			{
				"Text": "Select a mod config asset in a Content Browser in the editor and then press this button to preview it in the widget."
			},
			"Key": "3301CEED4115AA63B23D75ADBE71BCD8"
		},
		{
			"Source":
			{
				"Text": "Selected"
			},
			"Translation":
			{
				"Text": "Selected"
			},
			"Key": "9C058BF04BDE1709C621FFAE1B31DB2B"
		},
		{
			"Source":
			{
				"Text": "Selected Node"
			},
			"Translation":
			{
				"Text": "Selected Node"
			},
			"Key": "2A104A5044211486473FD7ABAF0786DE"
		},
		{
			"Source":
			{
				"Text": "Selected asset was not a MAM schematic"
			},
			"Translation":
			{
				"Text": "Selected asset was not a MAM schematic"
			},
			"Key": "28D4DA8D463D419145CF3998168819A5"
		},
		{
			"Source":
			{
				"Text": "Selected asset was not a schematic"
			},
			"Translation":
			{
				"Text": "Selected asset was not a schematic"
			},
			"Key": "15467308467C6A5D14182D9A9858CF0F"
		},
		{
			"Source":
			{
				"Text": "Selected asset was not a tree"
			},
			"Translation":
			{
				"Text": "Selected asset was not a tree"
			},
			"Key": "990C0550403088B255B8EDBE5CB39735"
		},
		{
			"Source":
			{
				"Text": "Selected: {X} / {Y}"
			},
			"Translation":
			{
				"Text": "Selected: {X} / {Y}"
			},
			"Key": "A384A4F2411BB5B5D2F8ED82E93A148A"
		},
		{
			"Source":
			{
				"Text": "Set Schematic"
			},
			"Translation":
			{
				"Text": "Set Schematic"
			},
			"Key": "A55CFECD49F34F881458079D6C4466E8"
		},
		{
			"Source":
			{
				"Text": "Set Schematic from Selected"
			},
			"Translation":
			{
				"Text": "Set Schematic from Selected"
			},
			"Key": "1D2105BE47FDAF7B3D0AE39A198D6D52"
		},
		{
			"Source":
			{
				"Text": "Set selected Mod Config"
			},
			"Translation":
			{
				"Text": "Set selected Mod Config"
			},
			"Key": "F82E6B14485DB12E682CCAAEE979A8FC"
		},
		{
			"Source":
			{
				"Text": "Set selected Mod Config"
			},
			"Translation":
			{
				"Text": "Set selected Mod Config"
			},
			"Key": "83B9EB0A4C2BD981E2CC378C80663736"
		},
		{
			"Source":
			{
				"Text": "Set the schematic at the node you have selected to the asset you have selected in a content browser.\r\n\r\nMake sure it's a descendent of FGSchematic and of mType=MAM"
			},
			"Translation":
			{
				"Text": "Set the schematic at the node you have selected to the asset you have selected in a content browser.\r\n\r\nMake sure it's a descendent of FGSchematic and of mType=MAM"
			},
			"Key": "E1BFD9924871AF822E3E398F0F73F633"
		},
		{
			"Source":
			{
				"Text": "Set the schematic of the hidden node to the asset you have selected in a content browser.\r\n\r\nMake sure it's a descendent of FGSchematic and of mType=MAM"
			},
			"Translation":
			{
				"Text": "Set the schematic of the hidden node to the asset you have selected in a content browser.\r\n\r\nMake sure it's a descendent of FGSchematic and of mType=MAM"
			},
			"Key": "7B6C18F3429DC2551A9777A7334737BE"
		},
		{
			"Source":
			{
				"Text": "Shift + double click to open schematic asset"
			},
			"Translation":
			{
				"Text": "Shift + double click to open schematic asset"
			},
			"Key": "E9E72FE24A4B67BA77BFD8A046203BD0"
		},
		{
			"Source":
			{
				"Text": "Show Y lines: "
			},
			"Translation":
			{
				"Text": "Show Y lines: "
			},
			"Key": "FFE65C7C4022230ACACDAE8531BAC583"
		},
		{
			"Source":
			{
				"Text": "Show/hide scrolling grid animation"
			},
			"Translation":
			{
				"Text": "Show/hide scrolling grid animation"
			},
			"Key": "CBDFD51244B53B56A937438E8CB32951"
		},
		{
			"Source":
			{
				"Text": "This is the same coordinate as the selected node. Nodes that are their own parent or unhide themselves are inaccessible."
			},
			"Translation":
			{
				"Text": "This is the same coordinate as the selected node. Nodes that are their own parent or unhide themselves are inaccessible."
			},
			"Key": "0E952FE6486671AC4EAE0DA886E39F6C"
		},
		{
			"Source":
			{
				"Text": "Tip: Use ALT + double click to add/remove a node that will be Unhidden By the selected node"
			},
			"Translation":
			{
				"Text": "Tip: Use ALT + double click to add/remove a node that will be Unhidden By the selected node"
			},
			"Key": "9D2D424D42C331A3200AEAAC91348886"
		},
		{
			"Source":
			{
				"Text": "Tip: Use Control + double click to add/remove a node as Parent of the selected node"
			},
			"Translation":
			{
				"Text": "Tip: Use Control + double click to add/remove a node as Parent of the selected node"
			},
			"Key": "10E0A67443DE69541B1EDC930EA0F3A4"
		},
		{
			"Source":
			{
				"Text": "Tips"
			},
			"Translation":
			{
				"Text": "Tips"
			},
			"Key": "14AD17054700B3DFB1777B921DD6D63B"
		},
		{
			"Source":
			{
				"Text": "To Unhide"
			},
			"Translation":
			{
				"Text": "To Unhide"
			},
			"Key": "742DDFE8478CDBDAFCF07E9182300761"
		},
		{
			"Source":
			{
				"Text": "To Unhide"
			},
			"Translation":
			{
				"Text": "To Unhide"
			},
			"Key": "37AB38D742E105A25B00149432C2A0CC"
		},
		{
			"Source":
			{
				"Text": "To Use This Editor Widget:"
			},
			"Translation":
			{
				"Text": "To Use This Editor Widget:"
			},
			"Key": "EA4A561645F34241DD7FA79D0565817C"
		},
		{
			"Source":
			{
				"Text": "UNUSED"
			},
			"Translation":
			{
				"Text": "UNUSED"
			},
			"Key": "DED94E3E419B5E4B803BB08A22623726"
		},
		{
			"Source":
			{
				"Text": "UnhiddenBy"
			},
			"Translation":
			{
				"Text": "UnhiddenBy"
			},
			"Key": "F03FBFDA4CD7C1EFE3F314B5A8091F05"
		},
		{
			"Source":
			{
				"Text": "Unlock Costs:"
			},
			"Translation":
			{
				"Text": "Unlock Costs:"
			},
			"Key": "7AFE98A94C8C44BE766D148E5A4E6AA0"
		},
		{
			"Source":
			{
				"Text": "Warning - no nodes found at this coordinate"
			},
			"Translation":
			{
				"Text": "Warning - no nodes found at this coordinate"
			},
			"Key": "12D274BB4DF80CB2825839A7BE3B4B50"
		},
		{
			"Source":
			{
				"Text": "Writes the changes you made in this editor to the tree asset.\r\nYou still have to manually save the asset for the changes\r\nto be written to disk."
			},
			"Translation":
			{
				"Text": "Writes the changes you made in this editor to the tree asset.\r\nYou still have to manually save the asset for the changes\r\nto be written to disk."
			},
			"Key": "6DB3A6344D2B996A70E3F99487B4A471"
		},
		{
			"Source":
			{
				"Text": "Wrote changes to {treename}"
			},
			"Translation":
			{
				"Text": "Wrote changes to {treename}"
			},
			"Key": "3F8287C14D51CEF0A777ABB09751E5F5"
		},
		{
			"Source":
			{
				"Text": "X/Y coordinates of the node you have selected"
			},
			"Translation":
			{
				"Text": "X/Y coordinates of the node you have selected"
			},
			"Key": "83B4F90442F0CCB162E6FB9A700E981D"
		},
		{
			"Source":
			{
				"Text": "X:"
			},
			"Translation":
			{
				"Text": "X:"
			},
			"Key": "54918F714C768FF9A02A8D8F16CA271D"
		},
		{
			"Source":
			{
				"Text": "X:"
			},
			"Translation":
			{
				"Text": "X:"
			},
			"Key": "287174CB49DBEEB9318CB6ABBBED72A6"
		},
		{
			"Source":
			{
				"Text": "Y:"
			},
			"Translation":
			{
				"Text": "Y:"
			},
			"Key": "10B57BED4D623CA7671198A30F76FA15"
		},
		{
			"Source":
			{
				"Text": "Y:"
			},
			"Translation":
			{
				"Text": "Y:"
			},
			"Key": "D49C6DE34F805D7835D985AE5405DB99"
		},
		{
			"Source":
			{
				"Text": "You can use the play in editor functionality to test widgets and code from the editor without having to package your mod and launch the game. To do this, open a level in the editor (ex. SMLEditor_Testing) and either drop in actors or edit the level blueprint (\"Blueprints > Open Level Blueprint\") to add code. Test it via the editor's Play button.\r\n\r\nKeep in mind that many game, SML, and mod systems are not initalized in the editor, so you may have to modify your code to detect if it's running in the editor and swap in placeholder values. Beware of editor crashes and save often."
			},
			"Translation":
			{
				"Text": "You can use the play in editor functionality to test widgets and code from the editor without having to package your mod and launch the game. To do this, open a level in the editor (ex. SMLEditor_Testing) and either drop in actors or edit the level blueprint (\"Blueprints > Open Level Blueprint\") to add code. Test it via the editor's Play button.\r\n\r\nKeep in mind that many game, SML, and mod systems are not initalized in the editor, so you may have to modify your code to detect if it's running in the editor and swap in placeholder values. Beware of editor crashes and save often."
			},
			"Key": "8EE592524D7AA8E9B67E4BB849F2353A"
		},
		{
			"Source":
			{
				"Text": "[Button Disabled: No node is selected, or the node already lacks a schematic]\r\n\r\n{OriginalMessage}"
			},
			"Translation":
			{
				"Text": "[Button Disabled: No node is selected, or the node already lacks a schematic]\r\n\r\n{OriginalMessage}"
			},
			"Key": "67CDCF2649DBC28D88D73EA17DE82A16"
		},
		{
			"Source":
			{
				"Text": "[Button Disabled: No node is selected, or the node already lacks a schematic]\r\n\r\n{OriginalMessage}"
			},
			"Translation":
			{
				"Text": "[Button Disabled: No node is selected, or the node already lacks a schematic]\r\n\r\n{OriginalMessage}"
			},
			"Key": "4B41A95D497C8E5D98BA45B475E0863A"
		},
		{
			"Source":
			{
				"Text": "[Button Disabled: No tree selected, or invalid class]\r\n\r\n{OriginalMessage}"
			},
			"Translation":
			{
				"Text": "[Button Disabled: No tree selected, or invalid class]\r\n\r\n{OriginalMessage}"
			},
			"Key": "FB93C4DE49F1D86203B0669DBC756CE3"
		},
		{
			"Source":
			{
				"Text": "[Button Disabled: Nothing to clear]\r\n\r\n{OriginalMessage}"
			},
			"Translation":
			{
				"Text": "[Button Disabled: Nothing to clear]\r\n\r\n{OriginalMessage}"
			},
			"Key": "F9F3B731489E1ACFA94D978521EBCBA3"
		}
	],
	"Subnamespaces": [
		{
			"Namespace": "GraphNodeK2Create",
			"Children": [
				{
					"Source":
					{
						"Text": "Create matching signiture"
					},
					"Translation":
					{
						"Text": "Create matching signiture"
					},
					"Key": "CreateMatchingSigniture"
				},
				{
					"Source":
					{
						"Text": "Error"
					},
					"Translation":
					{
						"Text": "Error"
					},
					"Key": "Error"
				},
				{
					"Source":
					{
						"Text": "Error? {0}"
					},
					"Translation":
					{
						"Text": "Error? {0}"
					},
					"Key": "ErrorLabelFmt"
				},
				{
					"Source":
					{
						"Text": "Select Function..."
					},
					"Translation":
					{
						"Text": "Select Function..."
					},
					"Key": "SelectFunctionLabel"
				},
				{
					"Source":
					{
						"Text": "[Create a matching function]"
					},
					"Translation":
					{
						"Text": "[Create a matching function]"
					},
					"Key": "CreateMatchingFunctionOption"
				},
				{
					"Source":
					{
						"Text": "[None]"
					},
					"Translation":
					{
						"Text": "[None]"
					},
					"Key": "EmptyFunctionOption"
				}
			]
		},
		{
			"Namespace": "SML",
			"Children": [
				{
					"Source":
					{
						"Text": "Add Variable"
					},
					"Translation":
					{
						"Text": "Add Variable"
					},
					"Key": "AddVariable"
				},
				{
					"Source":
					{
						"Text": "Blueprint '{0}' does not contain a valid root section. Make sure 'Root Section' property has a valid object value"
					},
					"Translation":
					{
						"Text": "Blueprint '{0}' does not contain a valid root section. Make sure 'Root Section' property has a valid object value"
					},
					"Key": "MissingRootSection"
				},
				{
					"Source":
					{
						"Text": "Blueprint '{0}' is not compiled, or does not inherit from Mod Configuration. Make sure blueprint is compiled successfully and has Mod Configuration as a parent class"
					},
					"Translation":
					{
						"Text": "Blueprint '{0}' is not compiled, or does not inherit from Mod Configuration. Make sure blueprint is compiled successfully and has Mod Configuration as a parent class"
					},
					"Key": "MissingGeneratedClass"
				},
				{
					"Source":
					{
						"Text": "Cannot create struct asset because of the invalid package name '{0}'"
					},
					"Translation":
					{
						"Text": "Cannot create struct asset because of the invalid package name '{0}'"
					},
					"Key": "InvalidPackageName"
				},
				{
					"Source":
					{
						"Text": "Cannot generate native header file for configuration blueprint '{0}': {1}."
					},
					"Translation":
					{
						"Text": "Cannot generate native header file for configuration blueprint '{0}': {1}."
					},
					"Key": "CannotGenerateNativeConfig"
				},
				{
					"Source":
					{
						"Text": "Configuration"
					},
					"Translation":
					{
						"Text": "Configuration"
					},
					"Key": "ConfigSubCategory"
				},
				{
					"Source":
					{
						"Text": "Configuration Struct '{0}' cannot have a member '{1}' of predefined type: {2}. Make sure your configuration does not contain recursion or invalid property types."
					},
					"Translation":
					{
						"Text": "Configuration Struct '{0}' cannot have a member '{1}' of predefined type: {2}. Make sure your configuration does not contain recursion or invalid property types."
					},
					"Key": "StructCannotHaveMemberOfType"
				},
				{
					"Source":
					{
						"Text": "Couldn't create config struct asset at package name '{0}'"
					},
					"Translation":
					{
						"Text": "Couldn't create config struct asset at package name '{0}'"
					},
					"Key": "NameOccupied"
				},
				{
					"Source":
					{
						"Text": "Failed to save header file at path '{0}'"
					},
					"Translation":
					{
						"Text": "Failed to save header file at path '{0}'"
					},
					"Key": "FailedToOpenFile"
				},
				{
					"Source":
					{
						"Text": "Generate C++ Config Struct Header"
					},
					"Translation":
					{
						"Text": "Generate C++ Config Struct Header"
					},
					"Key": "GenerateNativeBlueprintStruct"
				},
				{
					"Source":
					{
						"Text": "Generates a C++ header containing struct definitions generated from the Configuration layout"
					},
					"Translation":
					{
						"Text": "Generates a C++ header containing struct definitions generated from the Configuration layout"
					},
					"Key": "GenerateNativeBlueprintStructTooltip"
				},
				{
					"Source":
					{
						"Text": "Get {0}"
					},
					"Translation":
					{
						"Text": "Get {0}"
					},
					"Key": "GetModConfigNodeTitle"
				},
				{
					"Source":
					{
						"Text": "Node @@ does not reference a valid configuration struct"
					},
					"Translation":
					{
						"Text": "Node @@ does not reference a valid configuration struct"
					},
					"Key": "InvalidConfigClass"
				},
				{
					"Source":
					{
						"Text": "Package with name '{0} already exists, but it's type is not a user defined struct. Delete it or make sure it contains a correct user defined struct."
					},
					"Translation":
					{
						"Text": "Package with name '{0} already exists, but it's type is not a user defined struct. Delete it or make sure it contains a correct user defined struct."
					},
					"Key": "InvalidConfigAsset"
				},
				{
					"Source":
					{
						"Text": "Regenerate Config Struct"
					},
					"Translation":
					{
						"Text": "Regenerate Config Struct"
					},
					"Key": "GenerateBlueprintStruct"
				},
				{
					"Source":
					{
						"Text": "Regenerates User-Defined Struct from the Configuration layout"
					},
					"Translation":
					{
						"Text": "Regenerates User-Defined Struct from the Configuration layout"
					},
					"Key": "GenerateBlueprintStructTooltip"
				},
				{
					"Source":
					{
						"Text": "Retrieves active configuration value for given configuration type"
					},
					"Translation":
					{
						"Text": "Retrieves active configuration value for given configuration type"
					},
					"Key": "GetModConfigNodeTooltip"
				},
				{
					"Source":
					{
						"Text": "Save Configuration '{0}' Struct Header"
					},
					"Translation":
					{
						"Text": "Save Configuration '{0}' Struct Header"
					},
					"Key": "SaveNativeConfigHeader"
				},
				{
					"Source":
					{
						"Text": "Successfully generated Native Struct for Configuration '{0}' and saved them at '{1}'"
					},
					"Translation":
					{
						"Text": "Successfully generated Native Struct for Configuration '{0}' and saved them at '{1}'"
					},
					"Key": "BlueprintConfigStructRegenerated"
				},
				{
					"Source":
					{
						"Text": "You need to select a file name you want to use to save the struct header"
					},
					"Translation":
					{
						"Text": "You need to select a file name you want to use to save the struct header"
					},
					"Key": "NoFilesSelected"
				}
			]
		},
		{
			"Namespace": "SMLEditor",
			"Children": [
				{
					"Source":
					{
						"Text": "Array"
					},
					"Translation":
					{
						"Text": "Array"
					},
					"Key": "ArraySortNode_InputArrayName"
				},
				{
					"Source":
					{
						"Text": "Array input pin is not connected"
					},
					"Translation":
					{
						"Text": "Array input pin is not connected"
					},
					"Key": "ArraySortNode_ArrayNotConnected"
				},
				{
					"Source":
					{
						"Text": "Array input pin type does not match the cached type"
					},
					"Translation":
					{
						"Text": "Array input pin type does not match the cached type"
					},
					"Key": "ArraySortNode_InvalidArrayPin"
				},
				{
					"Source":
					{
						"Text": "Cannot resolve sorter function reference"
					},
					"Translation":
					{
						"Text": "Cannot resolve sorter function reference"
					},
					"Key": "ArraySortNode_CannotResolveFunction"
				},
				{
					"Source":
					{
						"Text": "Comparator Function Signature Error:"
					},
					"Translation":
					{
						"Text": "Comparator Function Signature Error:"
					},
					"Key": "ArrayNodeWrongComparatorFunction"
				},
				{
					"Source":
					{
						"Text": "Element Type: {ElementType}"
					},
					"Translation":
					{
						"Text": "Element Type: {ElementType}"
					},
					"Key": "ArraySortNode_ElementType"
				},
				{
					"Source":
					{
						"Text": "Input Pin type does not match the sorter function"
					},
					"Translation":
					{
						"Text": "Input Pin type does not match the sorter function"
					},
					"Key": "ArraySortNode_InputPinMismatch"
				},
				{
					"Source":
					{
						"Text": "No sorter function specified"
					},
					"Translation":
					{
						"Text": "No sorter function specified"
					},
					"Key": "ArraySortNode_NoFunction"
				},
				{
					"Source":
					{
						"Text": "Node @@ does not reference a valid sort function"
					},
					"Translation":
					{
						"Text": "Node @@ does not reference a valid sort function"
					},
					"Key": "ArraySortNode_InvalidFunctionName"
				},
				{
					"Source":
					{
						"Text": "Object"
					},
					"Translation":
					{
						"Text": "Object"
					},
					"Key": "ArraySortNode_InputObjectName"
				},
				{
					"Source":
					{
						"Text": "Pick Any"
					},
					"Translation":
					{
						"Text": "Pick Any"
					},
					"Key": "ArraySortNode_WildcardElementType"
				},
				{
					"Source":
					{
						"Text": "Provided function is not a valid comparator function"
					},
					"Translation":
					{
						"Text": "Provided function is not a valid comparator function"
					},
					"Key": "ArraySortNode_InvalidFunction"
				},
				{
					"Source":
					{
						"Text": "Sort Array"
					},
					"Translation":
					{
						"Text": "Sort Array"
					},
					"Key": "ArraySortNodeTitle"
				},
				{
					"Source":
					{
						"Text": "Sort array elements using the provided comparator function\nComparator should return true when item A is less than item B\n\nProvided by SMLEditor"
					},
					"Translation":
					{
						"Text": "Sort array elements using the provided comparator function\nComparator should return true when item A is less than item B\n\nProvided by SMLEditor"
					},
					"Key": "ArraySortNodeTitle_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Utilities | Array"
					},
					"Translation":
					{
						"Text": "Utilities | Array"
					},
					"Key": "ArraySortNodeCategory"
				}
			]
		}
	]
}